#ifndef EARTH_UTILS_H
#define EARTH_UTILS_H

//------------------------------------------------------------------------------
// Параметры модели геоида (используется эллипсоид Красовского)
//------------------------------------------------------------------------------
const double a = 6378245.0;
const double b = 6356863.01877;
const double e2 = 0.006693421623;

//--------------- programmes for transformation meter -> radian ----------------
// first parameter - displacement (in meters)
// second parameter - current lattitude (in radian)
// return parameter - displacement (in radian)

//------------------------------------------------------------------------------
// Изменение широты при движении вдоль меридиана
//------------------------------------------------------------------------------
double meter_rad_lat ( double delta_N, double Lat );


//------------------------------------------------------------------------------
// Изменение долготы при движении вдоль параллели
//------------------------------------------------------------------------------
double meter_rad_long ( double delta_E, double Lat );


//------------------------------------------------------------------------------
// Длина дуги параллели в 1 радиан на широте Lat
//------------------------------------------------------------------------------
double long1rad ( double Lat );

//------------------------------------------------------------------------------
// Радиус кривизны меридианного эллипса в точке, лежащей на широте Lat
// (везде это используется как длина дуги меридиана в 1 радиан на широте Lat)
//------------------------------------------------------------------------------
double lat1rad ( double Lat );

#endif